from second_win import *
win_x, win_y = 200, 50
win_width, win_height = 1000, 600

txt_hello = 'Добро пожаловать в программу по определению состояния здоровья при помощи теста Руфье!'
txt_next = 'Начать тестирование'
txt_instruction = 'Данное приложение позволит вам с помощью теста Руфье провести первичную диагностику вашего здоровья.\nПроба Руфье представляет собой нагрузочный комплекс, предназначенный для оценки работоспособности сердца при физической нагрухке.\nУ испытуемого, находящегося в положении лежа на спине в течение 5 мин, определяют частоту пульса за 15 секунд;\nзатем в течении 45 секунд испытуемый выполняет 30 приседаний.\nПосле окончания нагрузки испытуемый ложится, и у него вновь подсчитывается число пульсаций за первые 15 секунд,\nа потом - за последние 15 секунд первой минуты периода восстановления.\nВажно! Если в процессе проведения испытания вы почувствуете себя плохо, то тест необоходимо прервать и обратиться к врачу.'
txt_title = 'Здоровье'
txt_hintname = "Введите своё Ф.И.О.:"
txt_hintage = "Полных лет:"
txt_test1 = '15'
txt_test2 = '45'
txt_test3 = '30'
txt_sendresults = 'Отправить результаты тестирования'
txt_hinttest1 = 'Лягте на спину и замерьте пульс за 15 секунд. Нажмите на кнопку, чтобы запустить таймер.\nРезультат запишите в поле.'
txt_hinttest2 = 'Выполните 30 приседаний за 45 секунд. Для этого нажмите кнопку, чтобы запустить счетчик приседаний.'
txt_hinttest3 = 'Лягте на спину и измерьте пульс за первые и последние 15 секунд минуты.\nНажмите кнопку, чтобы запустить таймер.\nЗеленым обозначены секунды, в течение которых необходимо проводить измерения,\nчерным - минуты без замера пульсаций.\nРезультаты запишите в соответсвующие поля.'
txt_starttest1 = 'Начать первый тест'
txt_starttest2 = 'Начать делать приседания'
txt_starttest3 = 'Начать финальный тест'

name = ''
age = 15
txt_finalwin = ''
txt_index = 'Индекс Руфье:'
txt_workheart = 'Работоспособность тела'